Autodesk.Revit.DB.Architecture.StairsLandingType.Thickness
Thickness of the stairs landing.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for thickness must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The landing type doesn't have monolithic support.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsLandingType.IsMonolithic
True if the stairs landing is monolithic, false otherwise.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsLandingType
Represents a stairs landing type in Autodesk Revit.
Since:
2013